bloknayrb/vox-memo/firmware/sdkconfig.defaults
# Vox Memo sdkconfig defaults for ESP32-C6-Touch-AMOLED-1.8

# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash — 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Wi-Fi
CONFIG_ESP_WIFI_ENABLED=y

# LittleFS for memo storage
CONFIG_LITTLEFS_MAX_PARTITIONS=3

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_DISP_DEF_REFR_PERIOD=33
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_USE_OS=y
CONFIG_LV_OS_FREERTOS=y

# I2S audio
CONFIG_I2S_ISR_IRAM_SAFE=y

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH=n

# Power management
CONFIG_PM_ENABLE=y

# Console — UART0 only, free USB Serial/JTAG for data transfer
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
